# Transformed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh..::..Transformed Property
Mesh Class See Also
---
Transforms this mesh and returns the result.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Mesh this[
	Transform transform
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Transformed ( _
	transform As Transform _
) As Mesh
	Get
```

Visual C++
---
```text
public:
property Mesh^ Transformed[Transform^ transform] {
	Mesh^ get (Transform^ transform);
}
```

# ### Parameters
transform
    Type: Autodesk.Revit.DB..::..TransformThe transformation used to transform the profile.
# ### Return Value
The transformed mesh.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the handle of the specified transformation is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
Mesh Class
Autodesk.Revit.DB Namespace